# Type Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationAncillaryUsage..::..Type Property
FabricationAncillaryUsage Class See Also
---
Fabrication ancillary type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public FabricationAncillaryType Type { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Type As FabricationAncillaryType
	Get
```

Visual C++
---
```text
public:
property FabricationAncillaryType Type {
	FabricationAncillaryType get ();
}
```

# See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace